Repository: Tsengel1129/MINA_APP
Catalog: lib/l10n/intl_*.arb
Languages: mn

# addCategoryBottomSheetButtonTextAdd
source: ADD
mn: НЭМЭХ

# addCategoryBottomSheetButtonTextCancel
source: CANCEL
mn: ЦУЦЛАХ

# addCategoryBottomSheetHeadingText
source: {type} add new categories
mn: {type} ангилал шинээр нэмэх

# addCategoryBottomSheetLabelTextCategoryIcon
source: Icon
mn: Дүрс

# addCategoryBottomSheetLabelTextCategoryName
source: Categories name
mn: Ангиллын нэр

# addcategoryName
source: Name
mn: Нэр

source: Add reminder
mn: Сануулагч нэмэх

# categoriesDeleteAreYouSure
source: Are you sure you want to delete this category?
mn: Та энэ ангиллыг устгахдаа итгэлтэй байна уу

# categoriesScreenAppBarTitle
source: Categories
mn: Ангиллууд

# categoriesScreenButtonTextAddNew
source: ADD
mn: НЭМЭХ

# categoriesScreenSnackbarTextDelete
source: Delete
mn: Ангилал устгах

# categoriesScreenSnackbarTextDeleteMessage
source: Category deleted successfully
mn: Ангилал амжилттай устгагдлаа

# categoriesScreenSnackbarTextResetCategoriesAction
source: Yes
mn: Тийм

# categoriesScreenSnackbarTextResetCategoriesConfirmation
source: Are you sure you want to reset categories?
mn: Бүх ангиллыг хуучин хэвэнд нь буцаах уу?

# categoriesScreenSnackbarTextResetCategoriesSuccess
source: Reset successful
mn: Бүх ангилал амжилттай анхны төлөв рүү буцаагдлаа

# categoriesScreenTabBarTextExpense
source: Expense
mn: Зарлага

# categoriesScreenTabBarTextIncome
source: Income
mn: Орлого

# categoryName
source: {category, select, Salary {salary} Bonus {bonus} Gift {gift} Others {others} Refund {refund} Refund_to {refund_to} Loan {loan} Offering {offering} Apartment {apartment} Support {support} School_fee {school_fee} Food {food} Laundry {laundry} Children {children} Transportation {transportation} Dishes {dishes} Health {health} Beauty {beauty} Mobile {mobile} Education {education} Furniture {furniture} Clothes {clothes} Loan_intereset {loan_intereset} Travel {travel} Pets {pets} other {{category}}}
mn: {category, select, Salary {Цалин} Bonus {Бонус} Gift {Бэлэг} Others {Бусад} Refund {Хүүгийн орлого} Refund_to {Хүүгийн буцаалт} Loan {Өр төлбөр} Offering {1.10 өргөл} Apartment {Байр цахилгаан} Support {Тэтгэмж, бусад} School_fee {Сургалтын төлбөр} Food {Хоол хүнс} Laundry {Ахуйн хэрэглээ} Children {Хүүхдүүдэд} Transportation {Тээвэр} Dishes {Гадуур хоол} Health {Эрүүл мэнд} Beauty {Гоо сайхан} Mobile {Нэгж} Education {Боловсрол} Furniture {Тавилга} Clothes {Хувцас} Loan_intereset {Хүүгийн нэмэгдэл} Travel {Чөлөөт цаг, амралт} Pets {Тэжээвэр амьтан} other {{category}}}

# textNavHome
source: Home
mn: Нүүр

# textNavFilter
source: Filter
mn: Нарийвчлан харах

# textNavTransaction
source: Transaction
mn: Гүйлгээ

# textNavWallet
source: Wallet
mn: Данс

# textNavSettings
source: Settings
mn: Тохиргоо

# currenciesScreenAppBarTitle
source: Currency
mn: Мөнгөн тэмдэгтүүд

# currenciesScreenSnackbarTextResetCurrenciesAction
source: Yes
mn: Тийм

# currenciesScreenSnackbarTextResetCurrenciesConfirmation
source: Are you sure you want to reset currency?
mn: Бүх мөнгөн тэмдэгтүүдийг хуучин хэвэнд нь буцаахдаа итгэлтэй байна уу?

# currenciesScreenSnackbarTextResetCurrenciesSuccess
source: Reset successful
mn: Бүх мөнгөн тэмдэгтүүд амжилттай анхны төлөв рүү буцаагдлаа

# currencySetupTextHeadline
source: Please choose your currency
mn: Таны ашиглах мөнгөн тэмдэгт юу вэ?

# deleteAccountDialogButtonTextCancel
source: No, I dont want to delete my account
mn: Үгүй, Би бүртгэлээ устгахыг хүсэхгүй байна!

# deleteAccountDialogButtonTextDelete
source: Yes, I want to delete my account
mn: Тийм, миний бүртгэлийг устгана уу!

# deleteAccountDialogContent
source: You will deleting all data (profile settings, income, expenses...) Are you sure continue this step?
mn: Та өөрийн бүх датаг устгах гэж байна (Профайлын өгөгдөл болон, гүйлгээний мэдээлэл устгагдана) буцаах боломжгүй тул та итгэлтэй байна уу?

# deleteAccountDialogTitle
source: Are you sure you want to delete your account?
mn: Та өөрийн хаягийг устгахдаа итгэлтэй байна уу?

# expenseManagerDrawerMessageShare
source: This app is designed to help you keep track of your daily financial income and expenses.
mn: Энэхүү Апп нь таньд өдөр тутамдаа санхүүгийнхээ орлого зарлагыг хөтлөн явуулахад туслах зорилготой юм: https://example app share link

# expenseManagerDrawerTextAbout
source: About app
mn: Аппын талаар дэлгэрэнгүй

# expenseManagerDrawerTextAboutAppLegalese
source: Additional info
mn: Нэмэлт мэдээлэл бббббббб

# expenseManagerDrawerTextAboutFooter
source: Additional Info
mn: бас нэмэлт мэдээлэл йййййй!

# expenseManagerDrawerTextCategories
source: Categories
mn: Ангиллууд

# expenseManagerDrawerTextCurrencies
source: Currencies
mn: Мөнгөн тэмдэгтүүд

# expenseManagerDrawerTextExport
source: Export to JSON/CSV
mn: JSON/CSV ээр экспортлох

# expenseManagerDrawerTextLogout
source: Logout
mn: Гарах

# expenseManagerDrawerTextSettings
source: Settings
mn: Тохиргоо

# expenseManagerDrawerTextShare
source: Share
mn: Хуваалцах

# expenseManagerOverviewTextBalanceHeading
source: YOUR BUDGET
mn: ТАНЫ ТӨСӨВ

# expenseManagerOverviewTextBudgetSet
source: Your total balance {budgetAmount} {symbol} {monthYear} month {spendAmount} {symbol}
mn: Та Нийт үлдэгдэл болох {budgetAmount} {symbol}-өөс {monthYear} сарын байдлаар {spendAmount} {symbol} зарцуулсан байна.

# expenseManagerOverviewTextBudgetUnset
source: Click here to enter your general monthly budget
mn: Та энд дарж сарынхаа зарцуулах ерөнхий төсвийг оруулна уу

# exportBottomSheetButtonTextDownload
source: DOWNLOAD
mn: ТАТАХ

# exportBottomSheetButtonTextExport
source: EXPORT
mn: ЭКСПОРТЛОХ

# exportBottomSheetHeadingText
source: Export to CSV/JSON
mn: CSV/JSON оор экспортлох

# exportBottomSheetLabelTextEndDate
source: End date
mn: Дуусах хугацаа

# exportBottomSheetLabelTextStartDate
source: Start date
mn: Эхлэх хугацаа

# exportBottomSheetTextDateValidationError
source: The start time must be before the end time
mn: Эхлэх хугацаа дуусах хугацаанаас өмнө байх ёстой

# filterTitle
source: Filter
mn: Нарийвчлан харах

# filterTransfer
source: Transfer
mn: Шилжүүлэг

# filterTransferAccount
source: Account
mn: Данс сонгох

# homeDailyNoTransactionsTextSubtitle
source: Click on the + icon to add income / expenses
mn: өөрийн дансыг үүсгэсэн байх шаардлагатай

# homeDailyNoTransactionsTextTitle
source: If you have created an account
mn: Та орлого зарлага нэмэхийн өмнө

# loginButtonTextGoogle
source: Sign-in with Google
mn: Google ээр нэвтрэх

# loginButtonTextGuest
source: Guest login
mn: Зочноор нэвтрэх

# loginTextTagline
source: This app is designed to help you keep track of your daily financial income and expenses.
mn: Энэхүү Апп нь таньд өдөр тутамдаа санхүүгийнхээ орлого зарлагыг хөтлөн явуулахад туслах зорилготой юм.

# profileSetupButtonTextNext
source: NEXT
mn: ДАРААГИЙН

# profileSetupLabelTextEmailAddress
source: Email address
mn: И-Мейл хаяг

# profileSetupLabelTextFullName
source: Full name
mn: Овог нэр

# profileSetupTextHeadline
source: Please fill in your name and email address
mn: Та нэр болон и-мэйл хаягаа оруулна уу

# reminderBottomSheetchooseDate
source: Choose date
mn: Огноо сонгох

# reminderBottomSheetTextDate
source: Date
mn: Огноо

# reminderBottomSheetTextRepeat
source: Repeat
mn: Давтамж

# reminderBottomSheetTextRepeatDay
source: Day repeat
mn: Өдрийн давтамж

# reminderBottomSheetTextRepeatDay2
source: Frequency of days
mn: Давталтын зай

# reminderBottomSheetTextTittle
source: Title
mn: Гарчиг

source: Reminder deleted
mn: Сануулагч устгагдлаа

# reminderDeletedUndo
source: Undo
mn: Үйлдлийг буцаах

# reminderMinute
source: minute
mn: минутанд

# reminderSave
source: Save
mn: Хадгалах

# reminderSelectedDate
source: Selected date:
mn: Сонгосон өдөр:

# reminderSelectedTime
source: Selected time:
mn: Сонгосон цаг:

# reminderSelectTime
source: Time
mn: Цаг

# settingsAppBar
source: Settings
mn: Тохиргоо

# settingsBudgetPreferences
source: Budget
mn: Төсөв

# settingsGeneralPreferences
source: General
mn: Үндсэн

# settingsProfilePreferences
source: Edit profile
mn: Профайл засах

# settingsReminderPreferences
source: Reminder
mn: Сануулагч

# filteredTitle
source: Filtered Transactions
mn: Хайлтын Илэрц

# settingsScreenGeneral_TitlePreferences
source: General
mn: Ерөнхий

# settingsScreenHeaderTitleAccount
source: Register
mn: Бүртгэл

# settingsScreenHeaderTitleDangerZone
source: Danger zone
mn: Аюултай бүс

# settingsScreenHeaderTitlePreferences
source: Settings
mn: Тохиргоо

# settingsScreenSettingTitleAccentColor
source: Theme color
mn: Аппын өнгө

# settingsScreenSettingTitleBiometric
source: Fingerprint / face login
mn: Хурууны хээ/царайгаар нэвтрэх

# settingsScreenSettingTitleBiometricDescription
source: You will be logged in with your fingerprint and / or face each time you open the app.
mn: Та аппыг нээх болгонд хурууны хээ/болон царайгаар нэвтрэх болно.

# settingsScreenSettingTitleCurrency
source: Currency
mn: Мөнгөн тэмдэгт

# settingsScreenSettingTitleDeleteAccount
source: Delete your account
mn: Бүртгэл устгах

# settingsScreenSettingTitleEmailAddress
source: Email address
mn: И-мейл хаяг

# settingsScreenSettingTitleLanguage
source: Change language
mn: Хэл солих

# settingsScreenSettingTitleName
source: Full name
mn: Бүтэн Нэр

# settingsScreenSettingTitleTheme
source: Theme mode
mn: Дизайн

# settingsScreenSettingTitleThemeAMOLED
source: AMOLED mode
mn: Амолэд

# settingsScreenSettingTitleThemeDark
source: Dark mode
mn: Харанхуй

# settingsScreenSettingTitleThemeLight
source: Light mode
mn: Гэрэлтэй

# transactionBottomSheetButtonChooseWallet
source: Choose account
mn: Данс сонгох

# transactionBottomSheetButtonTextAccountExpense
source: From
mn: Аль данснаас

# transactionBottomSheetButtonTextAccountIncome
source: To
mn: Аль данснаас

# transactionBottomSheetButtonTextAdd
source: ADD
mn: НЭМЭХ

# transactionBottomSheetButtonTextExpense
source: Expense
mn: Зарлага

# transactionBottomSheetButtonTextIncome
source: Income
mn: Орлого

# transactionBottomSheetButtonTextUpdate
source: UPDATE
mn: ШИНЭЧЛЭХ

# transactionBottomSheetLabelTextAmount
source: Possible balance
mn: Дүн

# transactionBottomSheetLabelTextDate
source: Date
mn: Огноо

# transactionBottomSheetLabelTextDescription
source: Description (optional)
mn: Тайлбар (заавал биш)

# transactionBottomSheetTextHeadingAdd
source: New Transaction
mn: Шинэ гүйлгээ хийх

# transactionBottomSheetTextHeadingUpdate
source: Transaction renewal
mn: Гүйлгээ шинэчлэх

# transactionBottomTextAmount
source: Amount
mn: Дүн

# transactionListHiddenTransactionText
source: {howMany, plural, one {1 transaction hidden} бусад {{howMany} hidden transaction count}}
mn: {howMany, plural, one {1 гүйлгээ нуусан} бусад {{howMany} гүйлгээнүүд нуусан байна}}

# updateBudgetBottomSheetButtonTextClear
source: CLEAR
mn: ЦЭВЭРЛЭХ

# updateBudgetBottomSheetButtonTextSetBudget
source: YOUR BUDGET
mn: ТӨСӨВ ОРУУЛАХ

# updateBudgetBottomSheetHeadingText
source: Click here to enter your general monthly budget
mn: Та энд дарж сарынхаа зарцуулах ерөнхий төсвийг оруулна уу

# updateBudgetBottomSheetLabelTextBudget
source: YOUR BUDGET
mn: ТӨСӨВ

# walletBottomSheetLabelDescription
source: Description
mn: Дансны нэр

# walletBottomSheetLabelTextAmount
source: Account number
mn: Дансны дугаар

# walletBottomSheetLabelTextBankAccount
source: Bank account
mn: Харилцах данс

# walletBottomSheetLabelTextCash
source: Cash
mn: Бэлэн мөнгө

# walletBottomSheetLabelTextDescription
source: Bank name
mn: Банкны нэр

# walletBottomSheetLabelTextLoanAccount
source: Loan
mn: Зээлийн данс

# walletBottomSheetLabelTextSaving
source: Saving
mn: Хадгаламж

# walletBottomSheetTextHeadingAdd
source: New Wallet
mn: Шинэ данс үүсгэх

# walletBottomSheetTextHeadingUpdate
source: Update Wallet
mn: Данс Шинэчлэх

# walletBottomSheetType
source: Type
mn: Төрөл

# walletEmptySubText
source: Click + to create your account
mn: + дарж дансаа үүсгэнэ үү

# walletEmptyText
source: You do not have an account
mn: Танд нэмсэн данс байхгүй байна

# walletSectionEmptyText
source: Add your new card click the + button in the bottom right
mn: Таньд данс байхгүй байна + дарж данс нээнэ үү.

# walletTitle
source: Accounts
mn: Данснууд
